
Процедура КнопкаСформироватьНажатие(Кнопка)
	Закрыть();
КонецПроцедуры


Процедура ПериодыСравненияПриПолученииДанных(Элемент, ОформленияСтрок)
	Для Каждого Эл Из ОформленияСтрок Цикл
		Если ЗначениеЗаполнено(Эл.ДанныеСтроки.ДатаНачала) ИЛИ ЗначениеЗаполнено(Эл.ДанныеСтроки.ДатаОкончания) Тогда
			Эл.Ячейки.ПериодДляСравнения.УстановитьТекст(ПредставлениеПериода(НачалоДня(Эл.ДанныеСтроки.ДатаНачала),КонецДня(Эл.ДанныеСтроки.ДатаОкончания)));
		Иначе
			Эл.Ячейки.ПериодДляСравнения.УстановитьТекст("Нет периода");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПериодыСравненияПериодДляСравненияНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	НастройкаПериода = Новый НастройкаПериода;
	НачПериода = ЭлементыФормы.ПериодыСравнения.ТекущиеДанные.ДатаНачала;
	КонПериода = КонецДня(ЭлементыФормы.ПериодыСравнения.ТекущиеДанные.ДатаОкончания);
	
	НастройкаПериода.УстановитьПериод(НачПериода, ?(КонПериода='0001-01-01', КонПериода, КонецДня(КонПериода)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
		
		ЭлементыФормы.ПериодыСравнения.ТекущиеДанные.ДатаНачала		= НачПериода;
		ЭлементыФормы.ПериодыСравнения.ТекущиеДанные.ДатаОкончания	= КонПериода;
	КонецЕсли;
КонецПроцедуры

Процедура ПериодыСравненияПериодДляСравненияОчистка(Элемент, СтандартнаяОбработка)
	ЭлементыФормы.ПериодыСравнения.ТекущиеДанные.ДатаНачала		='00010101000000';
	ЭлементыФормы.ПериодыСравнения.ТекущиеДанные.ДатаОкончания	='00010101000000';
КонецПроцедуры
